{   "sectionWelcome":{
        "pHi": "Hi, i'm",
        "pFront": "Front-End Web Developer",
        "p1": "Hi, I'm Erik Prado, I currently live in Brazil and study computer science at UNICID University. I plan to graduate in 2028, and I'm focused on front-end studies, with the goal of specializing in full stack.",
        "p2": "I prioritize clean code development, with easy maintenance, quality and sustainability in projects, with responsive applications ensuring an exceptional user experience.",
        "contact": "Contact"
    },
    "sectionInfoNumber":{
        "commitp1": "Code",
        "commitp2": "commits",
        "projectsp1": "Projects",
        "projectsp2": "completed",
        "techp1": "Technologies",
        "techp2": "mastered",
        "articlesp1": "Writen",
        "articlesp2": "articles"
    },
    "sectionAbout": {
        "subtitle": "../about",
        "title": "About me."
    },
    "sectionBlog": {
        "title": "My articles."
    },
    "sectionTech":{
        "subtitle": "../tech",
        "title": "Technologies."
    },
    "sectionProject":{
        "subtitle": "../projects",
        "title": "Featured Projects.",
        "new" :"New Project",
        "tech" : "Technologies used:"
    },
    "sectionContact":{
        "subtitle": "../contact",
        "title": "Contact.",
        "p1": "Feel free to contact me, discuss collaborating on a project or simply say 'hi'. You can email me at",
        "p2": "Full name:",
        "p3": "Email address:",
        "p4": "Message:"
    },
    "pageProjectWindows":{
        "LinkGitHub": "GitHub Project Page",
        "LinkLinkedIn": "LinkedIn Post Page",
        "pResume": "With the main objective of providing immersion when turning on my desktop computer, having a lock screen, desktop, start menu with the option to open and close, and icons on the desktop that symbolize shortcuts to various website links.",
        "p1": "With the main objective of providing a unique immersion for the user, the project is in its first version, with future plans to add more tools, standardization settings, and more visual elements in the next versions.",
        "p2": "The font used for the project was Segoe Ui Variable Font, providing a thin and modern font.",
        "p3": "The images used were acquired by FreePik.",
        "p4": "To enable navigation between pages, React-Router-Dom was used, containing three main routes:",
        "p5": "Lock Screen:",
        "p6": "This is the first preview screen of the entire project, simulating the Windows lock screen. Containing the current time, interactive icons, profile picture and user name.",
        "p7": "Desktop:",
        "p8": "The second viewing screen simulates the Windows Desktop, containing the workspace with its respective icons and shortcuts, the taskbar and the start menu with the option to open and close.",
        "p9": "Error Page:",
        "p10": "React-Router-Dom allows us to create an error page whenever the website link is incorrect. With this possibility, I styled the error page to simulate the famous Windows blue screen error, with the option to return to the lock screen or to the desktop.",
        "p11": "It is worth noting that this screen can only be viewed if the page link contains an incorrect character."
    }
}



