{"sectionWelcome":{
        "pHi": "Olá, eu sou",
        "pFront": "Desenvolvedor Web Front-End",
        "p1": "Olá, sou Erik Prado, atualmente moro no Brasil e estudo ciência da computação na Universidade UNICID. Pretendo me formar em 2028, e estou focado em estudos front-end, com objetivo de me especializar em full stack.",
        "p2": "Priorizo ​​o desenvolvimento de código limpo, com fácil manutenção, qualidade e sustentabilidade nos projetos, com aplicações responsivas garantindo uma experiência de usuário excepcional.",
        "contact": "Contato"
    },
    "sectionInfoNumber":{
        "commitp1": "Commits de",
        "commitp2": "códigos",
        "projectsp1": "Projetos",
        "projectsp2": "completos",
        "techp1": "Tecnologias",
        "techp2": "dominadas",
        "articlesp1": "Artigos",
        "articlesp2": "escritos"
    },
    "sectionAbout": {
        "subtitle": "../sobre",
        "title": "Sobre mim."
    },
    "sectionBlog": {
        "title": "Meus artigos."
    },
    "sectionTech":{
        "subtitle": "../tecnologias",
        "title": "Tecnologias."
    },
    "sectionProject":{
        "subtitle": "../projetos",
        "title": "Projetos em destaque.",
        "new" :"Novo Projeto",
        "tech" : "Tecnologias usadas:"
    },
    "sectionContact":{
        "subtitle": "../contato",
        "title": "Contato.",
        "p1": "Sinta-se à vontade para entrar em contato comigo, discutir colaboração em um projeto ou simplesmente dizer 'oi'. Você pode me enviar um e-mail para",
        "p2": "Nome completo:",
        "p3": "Endereço de e-mail:",
        "p4": "Mensagem:"
    },
    "pageProjectWindows":{
        "LinkGitHub": "Página do Projeto GitHub:",
        "LinkLinkedIn": "Página da Publicação do LinkedIn:",
        "pResume": "Com o principal objetivo de proporcionar a imersão ao ligar meu computador desktop, possuindo tela de bloqueio, área de trabalho, menu iniciar com opção de abrir e fechar, e ícones na área de trabalho que simbolizam atalhos para diversos links de sites.",
        "p1": "Com o principal objetivo de proporcionar uma imersão única para o usuário, o projeto está na sua primeira versão, com planos futuros da adição de mais ferramentas, configurações de padronização, e mais elementos visuais nas próximas versões.",
        "p2": "A fonte utilizada para o projeto foi a Segoe Ui Variable Font, porporcionando uma fonte fina e moderna.",
        "p3": "As imagens utilizadas foram adquiridas pelo FreePink.",
        "p4": "Para realizar a possibilidade de navegação entre as páginas foi utilizado o React-Router-Dom, contendo três principais rotas:",
        "p5": "Tela de Bloqueio:",
        "p6": "Essa é a primeira tela de visualização de todo o projeto, simulando a tela de bloqueio do Windows. Contendo o horário atual, icones interativos, foto de perfil e o nome do usuário.",
        "p7": "Desktop:",
        "p8": "A segunda tela de visualização simula o Desktop do Windows, contendo a área de trabalho com seus respectivos ícones e atalhos, a barra de tarefas e o menu iniciar com a opção de abrir e fechar.",
        "p9": "Página de Erro:",
        "p10": "O React-Router-Dom nos possibilita criar uma página de erro quase o link do website estiver incorreto. Com essa possibilidade estilizei a página de erro para simular o famoso erro de tela azul do Windows, com opção de retornar para a tela de bloqueio ou para o desktop.",
        "p11": "Vale ressaltar que essa tela só pode ser visualizada caso o link da página tenha algum caractere errado."
    }
}


